<?php

require 'user.php';

class main_class extends user {

  function __construct() {
    parent::__construct("conn_main_class");
  }

  public function get_variable() {
    $variable = [
        "gender" => ["หญิง", "ชาย"],
        // "app_privilege" => [
        //     "" => "ยังไม่มีการเพิ่มสิทธิ์ในระบบ",
        //     "1" => "อำเภอ (ดูอย่างเดียว)",
        //     "2" => "อำเภอ (บันทึก)",
        //     "3" => "อำเภอ (admin อำเภอ)",
        //     "4" => "จังหวัด (บันทึก)",
        //     "5" => "จังหวัด (ออกรายงาน)",
        //     "6" => "จังหวัด (admin จังหวัด)",
        //     "7" => "ส่วนกลาง (ออกรายงาน)",
        //     "8" => "ส่วนกลาง (ผู้ดูแลระบบ)",
        //     "9" => "ผู้ดูแลระบบ ศสป.",
        // ],
        "app_privilege" => [
            "" => "ยังไม่มีการเพิ่มสิทธิ์ในระบบ",
            "1" => "",
            "2" => "แอดมินสถานีตำรวจ",
            "3" => "ผู้กำกับ",
            "4" => "สำนักงานอัยการ จังหวัด",
            "5" => "เจ้าหน้าที่รับเรื่อง กรมการปกครอง",
            "6" => "เจ้าหน้าที่รับเรื่อง สำนักงานอัยการสูงสุด",
            "7" => "สำนักงานอัยการสูงสุด",
            "8" => "สำนักการสอบสวนและนิติการ",
            "9" => "ผู้ดูแลระบบ ศสป.",
        ],
        "doc_level" => [
            "0" => "ยังไม่แสดง",
            "1" => "จังหวัดดูได้",
            "2" => "อำเภอดูได้",
            "3" => "ทั้งจังหวัดและอำเภอดูได้"
        ],
        "political_party" => [
            "1" => "ใหม่",
            "2" => "ประชาธิปไตยใหม่",
            "3" => "เป็นธรรม",
            "4" => "ท้องที่ไทย",
            "5" => "พลังสังคมใหม่",
            "6" => "ครูไทยเพื่อประชาชน",
            "7" => "ภูมิใจไทย",
            "8" => "แรงงานสร้างชาติ",
            "9" => "พลัง",
            "10" => "อนาคตไทย",
            "11" => "ประชาชาติ",
            "12" => "ไทยรวมไทย",
            "13" => "ไทยชนะ",
            "14" => "ชาติพัฒนากล้า",
            "15" => "กรีน",
            "16" => "พลังสยาม",
            "17" => "เสมอภาค",
            "18" => "ชาติไทยพัฒนา",
            "19" => "ภาคีเครือข่ายไทย",
            "20" => "เปลี่ยน",
            "21" => "ไทยภักดี",
            "22" => "รวมไทยสร้างชาติ",
            "23" => "รวมใจไทย",
            "24" => "เพื่อชาติ",
            "25" => "เสรีรวมไทย",
            "26" => "ประชาธิปัตย์",
            "27" => "พลังธรรมใหม่",
            "28" => "ไทยพร้อม",
            "29" => "เพื่อไทย",
            "30" => "ทางเลือกใหม่",
            "31" => "ก้าวไกล",
            "32" => "ไทยสร้างไทย",
            "33" => "ไทยเป็นหนึ่ง",
            "34" => "แผ่นดินธรรม",
            "35" => "รวมพลัง",
            "36" => "เพื่อชาติไทย",
            "37" => "พลังประชารัฐ",
            "38" => "เพื่อไทรวมพลัง",
            "39" => "มิติใหม่",
            "40" => "ประชาภิวัฒน์",
            "41" => "ไทยธรรม",
            "42" => "ไทยศรีวิไลย์",
            "43" => "พลังสหกรณ์",
            "44" => "ราษฎร์วิถี",
            "45" => "แนวทางใหม่",
            "46" => "ถิ่นกาขาวชาววิไล",
            "47" => "รวมแผ่นดิน",
            "48" => "เพื่ออนาคตไทย",
            "49" => "รักษ์ผืนป่าประเทศไทย",
            "50" => "พลังปวงชนไทย",
            "51" => "สามัญชน",
            "52" => "ชาติรุ่งเรือง",
            "53" => "พลังสังคม",
            "54" => "ภราดรภาพ",
            "55" => "ไทยก้าวหน้า",
            "56" => "ประชาไทย",
            "57" => "พลังเพื่อไทย",
            "58" => "สังคมประชาธิปไตยไทย",
            "59" => "ช่วยชาติ",
            "60" => "ความหวังใหม่",
            "61" => "คลองไทย",
            "62" => "พลังไทยรักชาติ",
            "63" => "ประชากรไทย",
            "64" => "เส้นด้าย",
            "65" => "เปลี่ยนอนาคต",
            "66" => "พลังประชาธิปไตย",
            "67" => "ไทยสมาร์ท"
        ],
    ];
    return $variable;
  }

}
